import streamlit as st

st.title("🧮 Tính Thuế Thu Nhập Cá Nhân của Nguyễn Quốc Phát")

st.divider()
a = st.number_input("Nhập thu nhập tính thuế của bạn (VNĐ):", min_value=0.0, step=1000000.0, format="%.0f")
if a > 0:
    b = 0
    c = 0.0

    if a <= 5000000:
        b = 1
        c = a * 0.05

    elif a <= 10000000:
        b = 2
        c = (5000000 * 0.05) + ((a - 5000000) * 0.10)

    elif a <= 18000000:
        b = 3
        c = (5000000 * 0.05) + (5000000 * 0.10) + ((a - 10000000) * 0.15)

    elif a <= 32000000:
        b = 4
        c = (5000000 * 0.05) + (5000000 * 0.10) + (8000000 * 0.15) + ((a - 18000000) * 0.20)

    elif a <= 52000000:
        b = 5
        c = (5000000 * 0.05) + (5000000 * 0.10) + (8000000 * 0.15) + (14000000 * 0.20) + ((a - 32000000) * 0.25)

    elif a <= 80000000:
        b = 6
        c = (5000000 * 0.05) + (5000000 * 0.10) + (8000000 * 0.15) + (14000000 * 0.20) + (20000000 * 0.25) + ((a - 52000000) * 0.30)

    else:
        b = 7
        c = (5000000 * 0.05) + (5000000 * 0.10) + (8000000 * 0.15) + (14000000 * 0.20) + (20000000 * 0.25) + (28000000 * 0.30) + ((a - 80000000) * 0.35)

  
    st.divider()
    st.subheader("KẾT QUẢ TÍNH THUẾ")
    
    col1 = st.columns(1)
    with col1:
        st.success(f"💵 Tiền thuế phải nộp:\n### {c:,.0f} VNĐ")
